# Time to clean our data to look into the effect of genre, director counts, and writer counts on a films gross and production budget

In [34]:
import numpy as np
import pandas as pd

In [35]:
%store -r dftitcrew
%store -r dfgross
%store -r dftitbasic
%store -r dfratings
%store -r dfbudgets

## First off, lets combine our titles and ratings dataframes
This links our movie titles to their relevant genres.

In [36]:
dftitbasic2 = dftitbasic.set_index('tconst')
dfrats = dfratings.set_index('tconst')
dfmovtit = dftitbasic2.join(dfrats)
display(dfmovtit.head())
dfmovtit.info()

,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
tconst,,,,,,,
tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0
tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43.0
tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0
tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13.0
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119.0

<class 'pandas.core.frame.DataFrame'>
Index: 146144 entries, tt0063540 to tt9916754
Data columns (total 7 columns):
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
averagerating      73856 non-null float64
numvotes           73856 non-null float64
dtypes: float64(3), int64(1), object(3)
memory usage: 13.9+ MB

## Working with Budgets and Movie Gross
Monetary information will be extremely important for basing business decisions, so lets get all of our financials into one dataframe.

In [37]:
dfgross2 = dfgross.set_index('title')
dfbudgets2 = dfbudgets.set_index('movie').drop('id', 1)
dfgross2.rename_axis('movie')
dfmoney = dfgross2.join(dfbudgets2, how='outer', rsuffix='**')
dfmoney.head()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,domestic_gross**,worldwide_gross
#Horror,NaN,NaN,NaN,NaN,"Nov 20, 2015","$1,500,000",$0,$0
'71,RAtt.,1300000.0,355000,2015.0,NaN,NaN,NaN,NaN
(500) Days of Summer,NaN,NaN,NaN,NaN,"Jul 17, 2009","$7,500,000","$32,425,665","$34,439,060"
"1,000 Times Good Night",FM,53900.0,NaN,2014.0,NaN,NaN,NaN,NaN
10 Cloverfield Lane,Par.,72100000.0,38100000,2016.0,"Mar 11, 2016","$5,000,000","$72,082,999","$108,286,422"

## Lets See an Overview

In [38]:
dfmoney.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7931 entries, #Horror to é·æ±ä¸è (CJ7)
Data columns (total 8 columns):
studio               3391 non-null object
domestic_gross       3368 non-null float64
foreign_gross        2044 non-null object
year                 3396 non-null float64
release_date         5782 non-null object
production_budget    5782 non-null object
domestic_gross**     5782 non-null object
worldwide_gross      5782 non-null object
dtypes: float64(2), object(6)
memory usage: 557.6+ KB

Here we can see that we have some non-numeric datatypes as well as some missing data.

## Importing our functions file and allowing it to be reloadable as we modify the file

In [39]:
from importlib import reload
import functions as fun

reload(fun)

## Getting all of our values to be the same

Three columns are filled with string values for the budget and gross so we're filling the null values in these columns with similar strings so that our conversion function can manipulate the entire column

In [40]:
dfmoney['production_budget'].fillna('$00', inplace = True)
dfmoney['domestic_gross**'].fillna('$0', inplace = True)
dfmoney['worldwide_gross'].fillna('$0', inplace = True)

In [41]:
dfmoney.head()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,domestic_gross**,worldwide_gross
#Horror,NaN,NaN,NaN,NaN,"Nov 20, 2015","$1,500,000",$0,$0
'71,RAtt.,1300000.0,355000,2015.0,NaN,$00,$0,$0
(500) Days of Summer,NaN,NaN,NaN,NaN,"Jul 17, 2009","$7,500,000","$32,425,665","$34,439,060"
"1,000 Times Good Night",FM,53900.0,NaN,2014.0,NaN,$00,$0,$0
10 Cloverfield Lane,Par.,72100000.0,38100000,2016.0,"Mar 11, 2016","$5,000,000","$72,082,999","$108,286,422"

In [42]:
dfmoney2 = dfmoney
dfmoney2['production_budget'] = dfmoney['production_budget'].apply(lambda x: fun.dollar_to_int(x))
dfmoney2['domestic_gross**'] = dfmoney['domestic_gross**'].apply(lambda x: fun.dollar_to_int(x))
dfmoney2['worldwide_gross'] = dfmoney['worldwide_gross'].apply(lambda x: fun.dollar_to_int(x))

In [43]:
display(dfmoney2.head())
dfmoney2.info()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,domestic_gross**,worldwide_gross
#Horror,NaN,NaN,NaN,NaN,"Nov 20, 2015",1500000.0,0.0,0.0
'71,RAtt.,1300000.0,355000,2015.0,NaN,0.0,0.0,0.0
(500) Days of Summer,NaN,NaN,NaN,NaN,"Jul 17, 2009",7500000.0,32425665.0,34439060.0
"1,000 Times Good Night",FM,53900.0,NaN,2014.0,NaN,0.0,0.0,0.0
10 Cloverfield Lane,Par.,72100000.0,38100000,2016.0,"Mar 11, 2016",5000000.0,72082999.0,108286422.0

<class 'pandas.core.frame.DataFrame'>
Index: 7931 entries, #Horror to é·æ±ä¸è (CJ7)
Data columns (total 8 columns):
studio               3391 non-null object
domestic_gross       3368 non-null float64
foreign_gross        2044 non-null object
year                 3396 non-null float64
release_date         5782 non-null object
production_budget    7931 non-null float64
domestic_gross**     7931 non-null float64
worldwide_gross      7931 non-null float64
dtypes: float64(5), object(3)
memory usage: 557.6+ KB

Great! It looks like all of our data is now in numeric form except our foreign_gross values. Lets go ahead and fix that!

In [44]:
dfmoney2['foreign_gross'] = dfmoney2['foreign_gross'].apply(str).str.replace(",", "").astype(float)

In [45]:
dfmoney2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7931 entries, #Horror to é·æ±ä¸è (CJ7)
Data columns (total 8 columns):
studio               3391 non-null object
domestic_gross       3368 non-null float64
foreign_gross        2044 non-null float64
year                 3396 non-null float64
release_date         5782 non-null object
production_budget    7931 non-null float64
domestic_gross**     7931 non-null float64
worldwide_gross      7931 non-null float64
dtypes: float64(6), object(2)
memory usage: 557.6+ KB

## Consolidating our domestic gross columns and removing the duplicate

In [46]:
dfmoney2['domestic_gross'] = dfmoney2.apply(
    lambda row: row['domestic_gross**'] if pd.isnull(row['domestic_gross']) else row['domestic_gross'], axis=1)

In [47]:
dfmoney2.head()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,domestic_gross**,worldwide_gross
#Horror,NaN,0.0,NaN,NaN,"Nov 20, 2015",1500000.0,0.0,0.0
'71,RAtt.,1300000.0,355000.0,2015.0,NaN,0.0,0.0,0.0
(500) Days of Summer,NaN,32425665.0,NaN,NaN,"Jul 17, 2009",7500000.0,32425665.0,34439060.0
"1,000 Times Good Night",FM,53900.0,NaN,2014.0,NaN,0.0,0.0,0.0
10 Cloverfield Lane,Par.,72100000.0,38100000.0,2016.0,"Mar 11, 2016",5000000.0,72082999.0,108286422.0

In [48]:
dfmoney2 = dfmoney2.drop('domestic_gross**', 1)
dfmoney2.head()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,worldwide_gross
#Horror,NaN,0.0,NaN,NaN,"Nov 20, 2015",1500000.0,0.0
'71,RAtt.,1300000.0,355000.0,2015.0,NaN,0.0,0.0
(500) Days of Summer,NaN,32425665.0,NaN,NaN,"Jul 17, 2009",7500000.0,34439060.0
"1,000 Times Good Night",FM,53900.0,NaN,2014.0,NaN,0.0,0.0
10 Cloverfield Lane,Par.,72100000.0,38100000.0,2016.0,"Mar 11, 2016",5000000.0,108286422.0

## Filling our missing Foreign Gross values with the difference between worldwide and domestic

In [49]:
dfmoney2['foreign_gross'] = dfmoney2.apply(lambda row: row['worldwide_gross'] - row['domestic_gross'] if pd.isnull(row['foreign_gross']) else row['foreign_gross'], axis = 1)

In [50]:
dfmoney2.head()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,worldwide_gross
#Horror,NaN,0.0,0.0,NaN,"Nov 20, 2015",1500000.0,0.0
'71,RAtt.,1300000.0,355000.0,2015.0,NaN,0.0,0.0
(500) Days of Summer,NaN,32425665.0,2013395.0,NaN,"Jul 17, 2009",7500000.0,34439060.0
"1,000 Times Good Night",FM,53900.0,-53900.0,2014.0,NaN,0.0,0.0
10 Cloverfield Lane,Par.,72100000.0,38100000.0,2016.0,"Mar 11, 2016",5000000.0,108286422.0

In [51]:
dfmoney2['foreign_gross'].value_counts()

 0.0            1594
 1200000.0        23
-1100000.0        19
-1200000.0        17
-1300000.0        16
                ...
 95600000.0        1
 12979087.0        1
 350800000.0       1
 288953319.0       1
 94400000.0        1
Name: foreign_gross, Length: 4714, dtype: int64

In [52]:
dfmoney2.head()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,worldwide_gross
#Horror,NaN,0.0,0.0,NaN,"Nov 20, 2015",1500000.0,0.0
'71,RAtt.,1300000.0,355000.0,2015.0,NaN,0.0,0.0
(500) Days of Summer,NaN,32425665.0,2013395.0,NaN,"Jul 17, 2009",7500000.0,34439060.0
"1,000 Times Good Night",FM,53900.0,-53900.0,2014.0,NaN,0.0,0.0
10 Cloverfield Lane,Par.,72100000.0,38100000.0,2016.0,"Mar 11, 2016",5000000.0,108286422.0

## To fill the missing worldwide gross values we need to add the domestic and foreign

Some foreign values now have negative numbers due to our previous operation so we need to revert these negative values back to zero otherwise our worldwide gross will be zero.

In [53]:
dfmoney2['foreign_gross'] = dfmoney2['foreign_gross'].clip(lower = 0)

In [54]:
dfmoney2.head()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,worldwide_gross
#Horror,NaN,0.0,0.0,NaN,"Nov 20, 2015",1500000.0,0.0
'71,RAtt.,1300000.0,355000.0,2015.0,NaN,0.0,0.0
(500) Days of Summer,NaN,32425665.0,2013395.0,NaN,"Jul 17, 2009",7500000.0,34439060.0
"1,000 Times Good Night",FM,53900.0,0.0,2014.0,NaN,0.0,0.0
10 Cloverfield Lane,Par.,72100000.0,38100000.0,2016.0,"Mar 11, 2016",5000000.0,108286422.0

In [55]:
dfmoney2['worldwide_gross'] = dfmoney2.apply(lambda row: row['domestic_gross'] + 
                                             row['foreign_gross'] if row['worldwide_gross'] == 0 else 
                                             row['worldwide_gross'], axis = 1)

In [56]:
dfmoney2.head()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,worldwide_gross
#Horror,NaN,0.0,0.0,NaN,"Nov 20, 2015",1500000.0,0.0
'71,RAtt.,1300000.0,355000.0,2015.0,NaN,0.0,1655000.0
(500) Days of Summer,NaN,32425665.0,2013395.0,NaN,"Jul 17, 2009",7500000.0,34439060.0
"1,000 Times Good Night",FM,53900.0,0.0,2014.0,NaN,0.0,53900.0
10 Cloverfield Lane,Par.,72100000.0,38100000.0,2016.0,"Mar 11, 2016",5000000.0,108286422.0

## After filling what data we could, theres still some missing data so we'll remove those rows we don't have values for

In [57]:
dfmoney4 = dfmoney2[dfmoney2['worldwide_gross'] != 0]

In [58]:
display(dfmoney4.head())
dfmoney4.info()

,studio,domestic_gross,foreign_gross,year,release_date,production_budget,worldwide_gross
'71,RAtt.,1300000.0,355000.0,2015.0,NaN,0.0,1655000.0
(500) Days of Summer,NaN,32425665.0,2013395.0,NaN,"Jul 17, 2009",7500000.0,34439060.0
"1,000 Times Good Night",FM,53900.0,0.0,2014.0,NaN,0.0,53900.0
10 Cloverfield Lane,Par.,72100000.0,38100000.0,2016.0,"Mar 11, 2016",5000000.0,108286422.0
10 Days in a Madhouse,NaN,14616.0,0.0,NaN,"Nov 11, 2015",12000000.0,14616.0

<class 'pandas.core.frame.DataFrame'>
Index: 7568 entries, '71 to é·æ±ä¸è (CJ7)
Data columns (total 7 columns):
studio               3391 non-null object
domestic_gross       7568 non-null float64
foreign_gross        7568 non-null float64
year                 3396 non-null float64
release_date         5419 non-null object
production_budget    7568 non-null float64
worldwide_gross      7568 non-null float64
dtypes: float64(5), object(2)
memory usage: 473.0+ KB

## Alright! We've consolidated our financial information as much as we could but now we need to find a correlation to genre.
First up, we'll join our money dataframe with the title and ratings dataframe we created at the top.

In [59]:
dfmovtit3 = dfmovtit
dfmovtit3['movie_id'] = dfmovtit3.index
dfmovtit3 = dfmovtit3.set_index('primary_title')

In [63]:
dfcomplete = dfmoney4.join(dfmovtit3)

Lets remove some columns that we won't be using for this project given time constraints.

In [66]:
dfpartial = dfcomplete.drop(['original_title', 'year', 'release_date', 'start_year', 'studio', 'averagerating', 'numvotes', 'runtime_minutes'], 1)
dfpartial.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9216 entries, '71 to é·æ±ä¸è (CJ7)
Data columns (total 6 columns):
domestic_gross       9216 non-null float64
foreign_gross        9216 non-null float64
production_budget    9216 non-null float64
worldwide_gross      9216 non-null float64
genres               5170 non-null object
movie_id             5253 non-null object
dtypes: float64(4), object(2)
memory usage: 504.0+ KB

In [67]:
dfpartial.head()

,domestic_gross,foreign_gross,production_budget,worldwide_gross,genres,movie_id
'71,1300000.0,355000.0,0.0,1655000.0,"Action,Drama,Thriller",tt2614684
(500) Days of Summer,32425665.0,2013395.0,7500000.0,34439060.0,NaN,NaN
"1,000 Times Good Night",53900.0,0.0,0.0,53900.0,"Drama,War",tt2353767
10 Cloverfield Lane,72100000.0,38100000.0,5000000.0,108286422.0,"Drama,Horror,Mystery",tt1179933
10 Days in a Madhouse,14616.0,0.0,12000000.0,14616.0,Drama,tt3453052

In [51]:
dfpartial['genres'].isna().sum()

4046

We still have some movies that are missing genre information. Considering genre information is essential to our inquiry we'll remove these values from our dataframe as well.

In [68]:
dftest = dfpartial[dfpartial['genres'].notnull()]

In [69]:
dftest.head()
dftest.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5170 entries, '71 to xXx: Return of Xander Cage
Data columns (total 6 columns):
domestic_gross       5170 non-null float64
foreign_gross        5170 non-null float64
production_budget    5170 non-null float64
worldwide_gross      5170 non-null float64
genres               5170 non-null object
movie_id             5170 non-null object
dtypes: float64(4), object(2)
memory usage: 282.7+ KB

In [71]:
dftest['genres'].isna().sum()

0

In [72]:
dftest.head()

,domestic_gross,foreign_gross,production_budget,worldwide_gross,genres,movie_id
'71,1300000.0,355000.0,0.0,1655000.0,"Action,Drama,Thriller",tt2614684
"1,000 Times Good Night",53900.0,0.0,0.0,53900.0,"Drama,War",tt2353767
10 Cloverfield Lane,72100000.0,38100000.0,5000000.0,108286422.0,"Drama,Horror,Mystery",tt1179933
10 Days in a Madhouse,14616.0,0.0,12000000.0,14616.0,Drama,tt3453052
10 Years,203000.0,0.0,0.0,203000.0,"Comedy,Drama,Romance",tt1715873

Our movie titles have become our index so lets turn those into a new column and reset our index.

In [73]:
dftest['movie_name'] = dftest.index

C:\Users\damni\anaconda3\envs\learn-env\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [79]:
dftest.index = range(len(dftest.index))

In [80]:
dftest.head()

,domestic_gross,foreign_gross,production_budget,worldwide_gross,genres,movie_id,movie_name
0,1300000.0,355000.0,0.0,1655000.0,"Action,Drama,Thriller",tt2614684,'71
1,53900.0,0.0,0.0,53900.0,"Drama,War",tt2353767,"1,000 Times Good Night"
2,72100000.0,38100000.0,5000000.0,108286422.0,"Drama,Horror,Mystery",tt1179933,10 Cloverfield Lane
3,14616.0,0.0,12000000.0,14616.0,Drama,tt3453052,10 Days in a Madhouse
4,203000.0,0.0,0.0,203000.0,"Comedy,Drama,Romance",tt1715873,10 Years

## Now we need a way to identify our films by a specific genre

In [81]:
dfGenres = dftest

Here we take the string value containing multiple genres and turn it into a list of genres.

In [84]:
dfGenres['genresList'] = fun.splitNewCol(dftest, 'genres')

C:\Users\damni\anaconda3\envs\learn-env\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [85]:
dfGenres.head()

,domestic_gross,foreign_gross,production_budget,worldwide_gross,genres,movie_id,movie_name,genresList
0,1300000.0,355000.0,0.0,1655000.0,"Action,Drama,Thriller",tt2614684,'71,"[Action, Drama, Thriller]"
1,53900.0,0.0,0.0,53900.0,"Drama,War",tt2353767,"1,000 Times Good Night","[Drama, War]"
2,72100000.0,38100000.0,5000000.0,108286422.0,"Drama,Horror,Mystery",tt1179933,10 Cloverfield Lane,"[Drama, Horror, Mystery]"
3,14616.0,0.0,12000000.0,14616.0,Drama,tt3453052,10 Days in a Madhouse,[Drama]
4,203000.0,0.0,0.0,203000.0,"Comedy,Drama,Romance",tt1715873,10 Years,"[Comedy, Drama, Romance]"

In [95]:
dfGenres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5170 entries, 0 to 5169
Data columns (total 8 columns):
domestic_gross       5170 non-null float64
foreign_gross        5170 non-null float64
production_budget    5170 non-null float64
worldwide_gross      5170 non-null float64
genres               5170 non-null object
movie_id             5170 non-null object
movie_name           5170 non-null object
genresList           5170 non-null object
dtypes: float64(4), object(4)
memory usage: 323.2+ KB

## We have our genres in a manageable list now. Now lets add some director and writer info

In [79]:
df = dfGenres
%store df

Stored 'df' (DataFrame)

Our title crew database has some null values for directors. Making the assumption that most films have a director, we'll fill these values with a placeholder.

In [98]:
dfcrew = dftitcrew.fillna('nm')

Here we'll use the same function as we did on the genres to pull to make the crew strings into lists so we can account for varying numbers of crew.

In [99]:
dfcrew['writersList'] = fun.splitNewCol(dfcrew, 'writers')
dfcrew['directorsList'] = fun.splitNewCol(dfcrew, 'directors')

In [101]:
dfcrew = dfcrew.drop(['directors', 'writers'], axis = 1)

In [102]:
dfcrew.head()

      tconst             writersList                      directorsList
0  tt0285252             [nm0899854]                        [nm0899854]
1  tt0438973  [nm0175726, nm1802864]                               [nm]
2  tt0462036             [nm1940585]                        [nm1940585]
3  tt0835418  [nm0310087, nm0841532]                        [nm0151540]
4  tt0878654             [nm0284943]  [nm0089502, nm2291498, nm2292011]

Great! Now we'll use another of Kaila's awesome functions to determine the count of each in a separate corresponding column.

In [104]:
dfcrew['writerCount'] = fun.countNewCol(dfcrew, 'writersList')
dfcrew['directorCount'] = fun.countNewCol(dfcrew, 'directorsList')

In [105]:
dfcrew.head()

,tconst,writersList,directorsList,writerCount,directorCount
0,tt0285252,[nm0899854],[nm0899854],1,1
1,tt0438973,"[nm0175726, nm1802864]",[nm],2,1
2,tt0462036,[nm1940585],[nm1940585],1,1
3,tt0835418,"[nm0310087, nm0841532]",[nm0151540],2,1
4,tt0878654,[nm0284943],"[nm0089502, nm2291498, nm2292011]",1,3

Now we'll drop the originial columns as we won't need them and set our index to allow for joining with our other dataframe.

In [106]:
dfcrew2 = dfcrew.drop(['writersList', 'directorsList'], axis = 1)

In [107]:
dfcrew2 = dfcrew2.set_index('tconst')

In [108]:
dfcrew2.head()

           writerCount  directorCount
tconst
tt0285252            1              1
tt0438973            2              1
tt0462036            1              1
tt0835418            2              1
tt0878654            1              3

## Now we'll combine our dataframes into one

In [109]:
df = dfGenres.set_index('movie_id')

In [115]:
dfwithcounts = df.join(dfcrew2)

In [116]:
dfwithcounts.head()

,domestic_gross,foreign_gross,production_budget,worldwide_gross,genres,movie_name,genresList,writerCount,directorCount
tt0249516,0.0,73706.0,45000000.0,73706.0,"Action,Animation,Comedy",Foodfight!,"[Action, Animation, Comedy]",5,1
tt0293429,70433227.0,51700000.0,20000000.0,122133227.0,"Action,Adventure,Fantasy",Mortal Kombat,"[Action, Adventure, Fantasy]",1,1
tt0315642,1100000.0,0.0,0.0,1100000.0,"Action,Crime,Drama",Wazir,"[Action, Crime, Drama]",8,1
tt0337692,744000.0,8000000.0,25000000.0,9313302.0,"Adventure,Drama,Romance",On the Road,"[Adventure, Drama, Romance]",2,1
tt0359950,58200000.0,129900000.0,91000000.0,187861183.0,"Adventure,Comedy,Drama",The Secret Life of Walter Mitty,"[Adventure, Comedy, Drama]",2,1

## Awesome! We're almost there!

Lets go ahead and drop our genres column and store this dataframe before we make further adjustments. This will allow us to take a look at the affect the number of directors and writers can have on a film.

In [122]:
countsdf = dfwithcounts.drop('genres', 1)

In [126]:
countsdf = countsdf.reset_index()

In [127]:
%store countsdf

Stored 'countsdf' (DataFrame)

## One last manipulation!
Here we'll use another awesome function from Kaila to create a new database that allows us to more easily group by specific genres and find their financial information.

In [130]:
final = pd.concat(fun.toConcat(countsdf))

In [131]:
final.head()

,Title,Genre,Domestic_Gross,Foreign_Gross,Worldwide_Gross,Production_Budget,Director_Count,Writer_Count
0,Wazir,Drama,1100000.0,0.0,1100000.0,0.0,1,8
1,On the Road,Drama,744000.0,8000000.0,9313302.0,25000000.0,1,2
2,The Secret Life of Walter Mitty,Drama,58200000.0,129900000.0,187861183.0,91000000.0,1,2
3,A Walk Among the Tombstones,Drama,26300000.0,26900000.0,62108587.0,28000000.0,1,2
4,Spy,Drama,110800000.0,124800000.0,235600000.0,0.0,1,3

In [132]:
%store final

Stored 'final' (DataFrame)